erp3l/src/DataProcessors/ДеревоРесурсныхСпецификаций/ДеревоРесурсныхСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДеревоРесурсныхСпецификаций</name>
  <tabularSections>
    <name>Этапы</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЭтапа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСледующегоЭтапа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Непрерывный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланироватьРаботуВидовРабочихЦентров</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьЭтапа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияДлительностиЭтапа</name>
      <type>
        <types>EnumRef.ЕдиницыИзмеренияВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредварительныйБуфер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗавершающийБуфер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОдновременноПроизводимаяПартия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияПредварительногоБуфера</name>
      <type>
        <types>EnumRef.ЕдиницыИзмеренияВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияЗавершающегоБуфера</name>
      <type>
        <types>EnumRef.ЕдиницыИзмеренияВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>МаршрутнаяКарта</name>
      <type>
        <types>CatalogRef.МаршрутныеКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиПродукция</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиПолуфабрикат</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиЭтапы</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыходныеИзделия</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСтоимости</name>
      <type>
        <types>EnumRef.ТипыСтоимостиВыходныхИзделий</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоляСтоимости</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиПолуфабрикат</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиПродукция</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиЭтапы</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыИУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <type>
        <types>CatalogRef.СтатьиКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяАвтовыбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СведенияАвтовыбора</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрименениеМатериала</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроизводитсяВПроцессе</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СпецификацияПолуфабриката</name>
      <type>
        <types>CatalogRef.РесурсныеСпецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <type>
        <types>EnumRef.ВариантыОбеспечения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказатьНаСклад</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиПродукция</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиЭтапы</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Запланировать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Трудозатраты</name>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.ВидыРаботСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <type>
        <types>CatalogRef.СтатьиКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиПродукция</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиЭтапы</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

erp3l/src/Enums/ВидыСтрокДереваСпецификаций/ВидыСтрокДереваСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтрокДереваСпецификаций</name>
  <enumValues>
    <name>ВыходноеИзделие</name>
  </enumValues>
  <enumValues>
    <name>ВыходныеИзделия</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>МатериалыИУслуги</name>
  </enumValues>
  <enumValues>
    <name>Номенклатура</name>
  </enumValues>
  <enumValues>
    <name>Трудозатрата</name>
  </enumValues>
  <enumValues>
    <name>Трудозатраты</name>
  </enumValues>
  <enumValues>
    <name>Этап</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Enums/ВидыПараметровНазначенияСпецификаций/ВидыПараметровНазначенияСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПараметровНазначенияСпецификаций</name>
  <enumValues>
    <name>ПодразделениеДиспетчер</name>
  </enumValues>
  <enumValues>
    <name>НаправлениеДеятельности</name>
  </enumValues>
  <enumValues>
    <name>ДопРеквизитПодразделения</name>
  </enumValues>
  <enumValues>
    <name>ДопРеквизитНаправленияДеятельности</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.ВидыНоменклатуры</owners>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Принципал</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаНоменклатурыДляЦенообразования</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/DataProcessors/ДеревоРесурсныхСпецификаций/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ДеревоДата = ТекущаяДатаСеанса();
	
	ПараметрыОтбора = ХранилищеНастроекДанныхФорм.Загрузить("ДеревоРесурсныхСпецификаций", "ПараметрыОтбора");
	Если ЗначениеЗаполнено(ПараметрыОтбора) Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ПараметрыОтбора);
	Иначе
		ДеревоВыводитьЭтапы                = Истина;
		ДеревоВыводитьВыходныеИзделия      = Истина;
		ДеревоВыводитьМатериалы            = Истина;
		ДеревоВыводитьТрудозатраты         = Истина;
		ДеревоВыводитьЗаголовкиГруппировок = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("Номенклатура") Тогда
		Если Параметры.Номенклатура.Этогруппа Тогда
			Возврат;
		КонецЕсли;
		ДеревоНоменклатура = Параметры.Номенклатура;
		
		// Проверяем использование характеристик для номенклатуры.
		РезультатПроверки = Справочники.Номенклатура.ХарактеристикаИУпаковкаПринадлежатВладельцу(
			ДеревоНоменклатура,
			Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(),
			Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
		
		НоменклатураХарактеристикаИспользуется = РезультатПроверки.ХарактеристикиИспользуются;
	КонецЕсли;
	
	Если Параметры.Свойство("ХарактеристикаНоменклатуры") Тогда
		ДеревоХарактеристикаНоменклатуры = Параметры.ХарактеристикаНоменклатуры;
	КонецЕсли;
	
	Если Параметры.Свойство("Спецификация") Тогда
		Спецификация = ПроверитьПолучитьСпецификацию(Параметры.Спецификация);
	КонецЕсли;
	
	Если Параметры.Свойство("Режим") Тогда
		Режим = Параметры.Режим;
	Иначе
		Режим = УправлениеДаннымиОбИзделияхКлиентСервер.РежимДеревоСпецификаций();
	КонецЕсли;
	
	Параметры.Свойство("ПодразделениеДиспетчер",  ПараметрНазначенияПодразделениеДиспетчер);
	Параметры.Свойство("НаправлениеДеятельности", ПараметрНазначенияНаправлениеДеятельности);
	ОбновитьЗаголовокГруппыПараметровНазначенияСпецификаций(ЭтаФорма);
	
	Если Режим = УправлениеДаннымиОбИзделияхКлиентСервер.РежимДеревоСпецификацийЗаказа() Тогда
		
		ЗаполнитьРеквизитыСпецификацииЗаказа(Параметры);
		
		Элементы.ДеревоСпецификаций.ТолькоПросмотр = Истина;
		Элементы.ГруппаСписокДоступныхСпецификаций.Видимость = Ложь;
	
		ЭтаФорма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ЭтаФорма.ЗакрыватьПриЗакрытииВладельца = Истина;
		
	КонецЕсли;
	
	ДинамическоеСчитывание = (Режим = УправлениеДаннымиОбИзделияхКлиентСервер.РежимДеревоСпецификаций());
	ПараметрыВыбораСпецификаций = УправлениеДаннымиОбИзделиях.ПараметрыВыбораСпецификаций(Новый Структура(), Обработки.ДеревоРесурсныхСпецификаций);
	
	Если НЕ Параметры.Свойство("Заголовок", Заголовок) И НЕ Спецификация.Пустая() Тогда
		Заголовок = СтрШаблон(НСтр("ru = 'Дерево спецификации ""%1""';
									|en = '""%1"" BOM tree'"), Спецификация);
	КонецЕсли;
	
	Если Параметры.Свойство("СформироватьПриОткрытии") Тогда
		СформироватьДеревоСпецификацийНаСервере();
	КонецЕсли;
	
	УправлениеДаннымиОбИзделиях.НастроитьУсловноеОформлениеДереваСпецификаций(УсловноеОформление);
	
	УстановитьСвойстваДинамическогоСпискаДоступныхСпецификаций();
	
	УстановитьВидимостьГруппыПараметровНазначенияСпецификаций(Режим = УправлениеДаннымиОбИзделияхКлиентСервер.РежимДеревоСпецификацийЗаказа());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьПолучитьСпецификацию(Спецификация)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Спецификация
	|ИЗ
	|	Справочник.РесурсныеСпецификации КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Спецификация И НЕ Таблица.ЭтоГруппа");
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Спецификация;
	Иначе
		Результат = Справочники.РесурсныеСпецификации.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Режим <> УправлениеДаннымиОбИзделияхКлиентСервер.РежимДеревоСпецификацийЗаказа()
		И Не ЗначениеЗаполнено(Спецификация)
		И Не ЗначениеЗаполнено(ДеревоНоменклатура) Тогда
		
		ТекстПредупреждения = НСтр("ru = 'Дерево спецификаций строится в контексте номенклатуры, ресурсной спецификации или спецификации заказа.';
									|en = 'BOM tree is built for products, BOM or order BOM.'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ТекущаяСтрока = Элементы.ДеревоСпецификаций.ТекущаяСтрока;
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.РесурсныеСпецификации.Форма.ФормаВыбораПоНоменклатуре" Тогда
		
		ИзменитьСпецификациюВТекущейСтроке(ТекущаяСтрока, ВыбранноеЗначение);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_РесурсныеСпецификации" Тогда
		Элементы.СписокДоступныхСпецификаций.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбновитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьЭтапыПриИзменении(Элемент)
	
	ИзмененыПараметрыОтбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьВыходныеИзделияПриИзменении(Элемент)
	
	ИзмененыПараметрыОтбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьМатериалыПриИзменении(Элемент)
	
	ИзмененыПараметрыОтбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьТрудозатратыПриИзменении(Элемент)
	
	ИзмененыПараметрыОтбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеДиспетчерПриИзменении(Элемент)
	ПриИзмененииЗначенияПараметраНазначенияСпецификаций();
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеДеятельностиПриИзменении(Элемент)
	ПриИзмененииЗначенияПараметраНазначенияСпецификаций();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыДеревоСпецификаций

&НаКлиенте
Процедура ДеревоСпецификацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ДеревоСпецификацийНоменклатура" 
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Номенклатура) 
		И ТипЗнч(Элемент.ТекущиеДанные.Номенклатура) <> Тип("Строка")
		И НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.ВидНоменклатуры) Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(Неопределено, Элемент.ТекущиеДанные.Номенклатура);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСпецификацийПриАктивизацииСтроки(Элемент)
	
	Если Режим = УправлениеДаннымиОбИзделияхКлиентСервер.РежимДеревоСпецификаций() Тогда
		ПодключитьОбработчикОжидания("ОбработатьАктивизациюСтрокиДерева", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСпецификацийПередРазворачиванием(Элемент, Строка, Отказ)
	
	УправлениеДаннымиОбИзделияхКлиентСервер.ДеревоСпецификацийПередРазворачиванием(ЭтаФорма, Строка, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСпецификацийПередСворачиванием(Элемент, Строка, Отказ)
	
	УправлениеДаннымиОбИзделияхКлиентСервер.ДеревоСпецификацийПередСворачиванием(ЭтаФорма, Строка, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСпецификацийСпецификацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ДеревоСпецификаций.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыСтрокДереваСпецификаций.ВыходноеИзделие") Тогда
		ИмяТЧ = "ВыходныеИзделия";
	Иначе
		ИмяТЧ = "МатериалыИУслуги";
	КонецЕсли;
	
	ДанныеОбИзделии = УправлениеДаннымиОбИзделияхКлиентСервер.СтруктураДанныхОбИзделииДляВыбораСпецификации();
	ДанныеОбИзделии.Номенклатура            = ТекущиеДанные.Номенклатура;
	ДанныеОбИзделии.Характеристика          = ТекущиеДанные.Характеристика;
	ДанныеОбИзделии.НачалоПроизводства      = ДеревоДата;
	ДанныеОбИзделии.ПодразделениеДиспетчер  = ПараметрНазначенияПодразделениеДиспетчер;
	ДанныеОбИзделии.НаправлениеДеятельности = ПараметрНазначенияНаправлениеДеятельности;
	
	УправлениеДаннымиОбИзделияхКлиент.ОткрытьФормуВыбораСпецификацийПоНоменклатуре(
		ДанныеОбИзделии,
		ПараметрыВыбораСпецификаций[ИмяТЧ],
		ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСпецификацийСпецификацияОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ДеревоСпецификаций.ТекущаяСтрока;
	ИзменитьСпецификациюВТекущейСтроке(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСпецификацийНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоСпецификаций.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ВидНоменклатуры) Тогда
		
		Элемент.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
		
	Иначе
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСпецификацийНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоСпецификаций.ТекущаяСтрока;
	ТекущиеДанные = Элементы.ДеревоСпецификаций.ТекущиеДанные;
	
	УправлениеДаннымиОбИзделияхКлиент.СохранитьРазвернутыеУровниДерева(ЭтаФорма, ТекущиеДанные);
	
	ДеревоСпецификацийНоменклатураПриИзмененииНаСервере(ТекущаяСтрока);
	
	УправлениеДаннымиОбИзделияхКлиент.ВосстановитьРазвернутыеУровниДерева(ЭтаФорма, ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ДеревоСпецификацийНоменклатураПриИзмененииНаСервере(ТекущаяСтрока)
	
	ТекущиеДанные = ДеревоСпецификаций.НайтиПоИдентификатору(ТекущаяСтрока);
	
	СтруктураДействий = Новый Структура;
	
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущиеДанные.Характеристика);
	СтруктураДействий.Вставить("ПроверитьУпаковкуПоВладельцу", ТекущиеДанные.Упаковка);
	СтруктураДействий.Вставить("ЗаполнитьПризнакЕдиницаИзмерения", Новый Структура("Номенклатура", "ЕдиницаИзмерения"));
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", Новый Структура("НужноОкруглять", Ложь));
	
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, Неопределено);
	
	ОбработатьИзменениеРеквизитаСтрокиДереваНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСпецификацийХарактеристикаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоСпецификаций.ТекущаяСтрока;
	ТекущиеДанные = Элементы.ДеревоСпецификаций.ТекущиеДанные;
	
	УправлениеДаннымиОбИзделияхКлиент.СохранитьРазвернутыеУровниДерева(ЭтаФорма, ТекущиеДанные);
	
	ДеревоСпецификацийХарактеристикаПриИзмененииНаСервере(ТекущаяСтрока);
	
	УправлениеДаннымиОбИзделияхКлиент.ВосстановитьРазвернутыеУровниДерева(ЭтаФорма, ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ДеревоСпецификацийХарактеристикаПриИзмененииНаСервере(ТекущаяСтрока)
	
	ТекущиеДанные = ДеревоСпецификаций.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если ТекущиеДанные.ВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыСтрокДереваСпецификаций.ВыходноеИзделие") Тогда
		ИмяТЧ = "ВыходныеИзделия";
	Иначе
		ИмяТЧ = "МатериалыИУслуги";
	КонецЕсли;
	
	СтруктураЗаполненияСпецификации = УправлениеДаннымиОбИзделияхКлиентСервер.ПараметрыДействияПроверитьЗаполнитьСпецификацию(
		ЭтотОбъект, ТекущиеДанные, ПараметрыВыбораСпецификаций[ИмяТЧ]);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьЗаполнитьСпецификацию", СтруктураЗаполненияСпецификации);
	
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, Неопределено);
	
	ОбработатьИзменениеРеквизитаСтрокиДереваНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСпецификацийУпаковкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоСпецификаций.ТекущаяСтрока;
	ТекущиеДанные = Элементы.ДеревоСпецификаций.ТекущиеДанные;
	
	УправлениеДаннымиОбИзделияхКлиент.СохранитьРазвернутыеУровниДерева(ЭтаФорма, ТекущиеДанные);
	
	ДеревоСпецификацийУпаковкаПриИзмененииНаСервере(ТекущаяСтрока);
	
	УправлениеДаннымиОбИзделияхКлиент.ВосстановитьРазвернутыеУровниДерева(ЭтаФорма, ТекущиеДанные);

КонецПроцедуры

&НаСервере
Процедура ДеревоСпецификацийУпаковкаПриИзмененииНаСервере(ТекущаяСтрока)
	
	ТекущиеДанные = ДеревоСпецификаций.НайтиПоИдентификатору(ТекущаяСтрока);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", Новый Структура("НужноОкруглять", Ложь));
	
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, Неопределено);
	
	ОбработатьИзменениеРеквизитаСтрокиДереваНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСпецификацийКоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоСпецификаций.ТекущаяСтрока;
	ТекущиеДанные = Элементы.ДеревоСпецификаций.ТекущиеДанные;
	
	УправлениеДаннымиОбИзделияхКлиент.СохранитьРазвернутыеУровниДерева(ЭтаФорма, ТекущиеДанные);
	
	ДеревоСпецификацийКоличествоУпаковокПриИзмененииНаСервере(ТекущаяСтрока);
	
	УправлениеДаннымиОбИзделияхКлиент.ВосстановитьРазвернутыеУровниДерева(ЭтаФорма, ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ДеревоСпецификацийКоличествоУпаковокПриИзмененииНаСервере(ТекущаяСтрока)
	
	ТекущиеДанные = ДеревоСпецификаций.НайтиПоИдентификатору(ТекущаяСтрока);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", Новый Структура("НужноОкруглять", Ложь));
	
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, Неопределено);
	
	ОбработатьИзменениеРеквизитаСтрокиДереваНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыСписокДоступныхСпецификаций

&НаКлиенте
Процедура СписокДоступныхСпецификацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.СписокДоступныхСпецификаций.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(,ТекущиеДанные.Спецификация);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьДерево(Команда)
	
	ОбновитьДанные();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДереваСпецификации(Команда)
	
	ПараметрКоманды = Новый Массив;
	ПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.РесурсныеСпецификации.ПустаяСсылка"));
	
	ИменаМакетов = "ДеревоСпецификаций";
	ПараметрыПечати = ПараметрыПечатиДереваСпецификаций();
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Обработка.ДеревоРесурсныхСпецификаций",
		ИменаМакетов,
		ПараметрКоманды,
		ЭтаФорма,
		ПараметрыПечати);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРазвернутьВсе(Команда)
	
	РазвернутьВсе();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСвернутьВсе(Команда)
	
	СвернутьВсе();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрыватьЗаголовкиГруппировок(Команда)
	
	ДеревоВыводитьЗаголовкиГруппировок = НЕ ДеревоВыводитьЗаголовкиГруппировок;
	Элементы.СкрыватьЗаголовкиГруппировок.Пометка = НЕ ДеревоВыводитьЗаголовкиГруппировок;
	
	ИзмененыПараметрыОтбора();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	СписокДоступныхСпецификаций.УсловноеОформление.Элементы.Очистить();
	Справочники.РесурсныеСпецификации.УстановитьУсловноеОформлениеСпискаДоступныхСпецификаций(СписокДоступныхСпецификаций.УсловноеОформление);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваДинамическогоСпискаДоступныхСпецификаций()
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	
	ТекстЗапроса = Справочники.РесурсныеСпецификации.ТекстЗапросаДинамическогоСпискаДоступныхСпецификаций();
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	
	СвойстваСписка.ОсновнаяТаблица = "";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Ложь;
	
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.СписокДоступныхСпецификаций, СвойстваСписка);
	
	ТекущийОтбор = УправлениеДаннымиОбИзделияхКлиентСервер.СтруктураОтбораСпискаДоступныхСпецификаций();
	ТекущийОтбор.Номенклатура   = ДеревоНоменклатура;
	ТекущийОтбор.Характеристика = ДеревоХарактеристикаНоменклатуры;
	
	УстановитьПараметрыСпискаДоступныхСпецификаций(ТекущийОтбор);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыСпецификацииЗаказа(ДанныеЗаполнения)
	
	РеквизитыСпецификацииЗаказа = Новый Структура;
	
	РеквизитыСпецификацииЗаказа.Вставить("КлючСвязи", ДанныеЗаполнения.КлючСвязи);
	
	РеквизитыСпецификацииЗаказа.Вставить("УпаковкаВыходногоИзделия", ДанныеЗаполнения.Упаковка);
	РеквизитыСпецификацииЗаказа.Вставить("КоличествоВыходногоИзделия", ДанныеЗаполнения.Количество);
	РеквизитыСпецификацииЗаказа.Вставить("КоличествоУпаковокВыходногоИзделия", ДанныеЗаполнения.КоличествоУпаковок);
	
	РеквизитыСпецификацииЗаказа.Вставить("АдресВХранилище", Параметры.АдресВХранилище);

КонецПроцедуры

&НаСервере
Функция ПараметрыПечатиДереваСпецификаций()
	
	Дерево = УправлениеДаннымиОбИзделиях.ПрочитатьДеревоСпецификаций(ЭтаФорма);
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("АдресВХранилище", ПоместитьВоВременноеХранилище(Дерево, УникальныйИдентификатор));
	
	Возврат ПараметрыПечати;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьДанные()
	
	УправлениеДаннымиОбИзделияхКлиент.СохранитьРазвернутыеУровниДерева(ЭтаФорма);
	
	СформироватьДеревоСпецификацийНаСервере();
	
	УправлениеДаннымиОбИзделияхКлиент.ВосстановитьРазвернутыеУровниДерева(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьАктивизациюСтрокиДерева()
	
	ПроверитьУстановитьПараметрыСпискаДоступныхСпецификаций();
	
КонецПроцедуры

&НаСервере
Функция ПараметрыДереваСпецификаций()
	
	ПараметрыДерева = УправлениеДаннымиОбИзделияхКлиентСервер.ПараметрыДереваСпецификаций();
	
	Если ДеревоСпецификаций.ПолучитьЭлементы().Количество() <> 0 Тогда
		Строка = ДеревоСпецификаций.ПолучитьЭлементы()[0];
		ПараметрыДерева.Номенклатура               = Строка.Номенклатура;
		ПараметрыДерева.ХарактеристикаНоменклатуры = Строка.Характеристика;
		ПараметрыДерева.Спецификация               = Строка.Спецификация;
	Иначе
		ПараметрыДерева.Номенклатура               = ДеревоНоменклатура;
		ПараметрыДерева.ХарактеристикаНоменклатуры = ДеревоХарактеристикаНоменклатуры;
		ПараметрыДерева.Спецификация               = Спецификация;
	КонецЕсли;
	
	ПараметрыДерева.ПараметрыВыбораСпецификаций  = ПараметрыВыбораСпецификаций;
	
	ПараметрыДерева.Дата                         = ДеревоДата;
	ПараметрыДерева.ПодразделениеДиспетчер       = ПараметрНазначенияПодразделениеДиспетчер;
	ПараметрыДерева.НаправлениеДеятельности      = ПараметрНазначенияНаправлениеДеятельности;
	
	ПараметрыДерева.ВыводитьЭтапы                = ДеревоВыводитьЭтапы;
	ПараметрыДерева.ВыводитьВыходныеИзделия      = ДеревоВыводитьВыходныеИзделия;
	ПараметрыДерева.ВыводитьМатериалы            = ДеревоВыводитьМатериалы;
	ПараметрыДерева.ВыводитьТрудозатраты         = ДеревоВыводитьТрудозатраты;
	ПараметрыДерева.ВыводитьЗаголовкиГруппировок = ДеревоВыводитьЗаголовкиГруппировок;
	
	ПараметрыДерева.ДинамическоеСчитывание       = ДинамическоеСчитывание;
	
	Если Режим = УправлениеДаннымиОбИзделияхКлиентСервер.РежимДеревоСпецификаций() Тогда
		ПараметрыДерева.РазузловыватьПолуфабрикаты = Истина;
	КонецЕсли;
	
	Если Режим = УправлениеДаннымиОбИзделияхКлиентСервер.РежимДеревоСпецификацийЗаказа() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыДерева, РеквизитыСпецификацииЗаказа);
	КонецЕсли;
	
	Возврат ПараметрыДерева;
	
КонецФункции

&НаСервере
Процедура СформироватьДеревоСпецификацийНаСервере()
	
	Если ИзмененыПараметрыОтбора Тогда
		СохранитьПараметрыОтбора();
	КонецЕсли;
	
	ПараметрыДерева = ПараметрыДереваСпецификаций();
	
	УправлениеДаннымиОбИзделиях.ПостроитьДеревоСпецификаций(ЭтаФорма, ПараметрыДерева);
	
КонецПроцедуры

&НаКлиенте
Функция НайтиСтрокуПоИдентификатору(КоллекцияЭлементовДерева, Идентификатор)
	
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
		
		Если Строка.Идентификатор = Идентификатор Тогда
			Возврат Строка;
		Иначе
			Результат = НайтиСтрокуПоИдентификатору(Строка.ПолучитьЭлементы(), Идентификатор);
			Если Результат <> Неопределено Тогда
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьУстановитьПараметрыСпискаДоступныхСпецификаций()
	
	ТекущиеДанные = Элементы.ДеревоСпецификаций.ТекущиеДанные;
	
	НовыйОтбор = УправлениеДаннымиОбИзделияхКлиентСервер.СтруктураОтбораСпискаДоступныхСпецификаций();
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Если ТипЗнч(ТекущиеДанные.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
			НовыйОтбор.Номенклатура   = ТекущиеДанные.Номенклатура;
			НовыйОтбор.Характеристика = ТекущиеДанные.Характеристика;
		КонецЕсли;
		
		ВидСтроки = ТекущиеДанные.ВидСтроки;
		
	Иначе
		ВидСтроки = Неопределено;
	КонецЕсли;
	
	Если НовыйОтбор.Номенклатура <> ТекущийОтбор.Номенклатура
		ИЛИ НовыйОтбор.Характеристика <> ТекущийОтбор.Характеристика Тогда
		УстановитьПараметрыСпискаДоступныхСпецификаций(НовыйОтбор, ВидСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСпискаДоступныхСпецификаций(НовыйОтбор, ВидСтроки = Неопределено)
	
	ТекущийОтбор    = НовыйОтбор;
	
	ДоступныеСпецификации    = Неопределено;
	
	Если ЗначениеЗаполнено(НовыйОтбор.Номенклатура) Тогда
	
		ДанныеОбИзделии = УправлениеДаннымиОбИзделияхКлиентСервер.СтруктураДанныхОбИзделииДляВыбораСпецификации();
		ДанныеОбИзделии.Номенклатура            = НовыйОтбор.Номенклатура;
		ДанныеОбИзделии.Характеристика          = НовыйОтбор.Характеристика;
		ДанныеОбИзделии.НачалоПроизводства      = ДеревоДата;
		ДанныеОбИзделии.НаправлениеДеятельности = ПараметрНазначенияНаправлениеДеятельности;
		ДанныеОбИзделии.ПодразделениеДиспетчер  = ПараметрНазначенияПодразделениеДиспетчер;
		
		Если ВидСтроки = ПредопределенноеЗначение("Перечисление.ВидыСтрокДереваСпецификаций.ВыходноеИзделие") Тогда
			ИмяТЧ = "ВыходныеИзделия";
		Иначе
			ИмяТЧ = "МатериалыИУслуги";
		КонецЕсли;
		
		ДоступныеСпецификации = УправлениеДаннымиОбИзделиях.СписокСпецификацийПоНоменклатуре(
			ДанныеОбИзделии,
			ПараметрыВыбораСпецификаций[ИмяТЧ]);
	
	КонецЕсли; 
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
									СписокДоступныхСпецификаций, "СписокСпецификаций", ДоступныеСпецификации);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеРеквизитаСтрокиДереваНаСервере(ТекущаяСтрока)

	ТекущиеДанные = ДеревоСпецификаций.НайтиПоИдентификатору(ТекущаяСтрока);

	ТекущиеДанные.ПолучитьЭлементы().Очистить();
	
	ТекущиеДанные.ЕстьСпецификация = ЗначениеЗаполнено(ТекущиеДанные.Спецификация);
	ТекущиеДанные.СпецификацияПрочитана = Ложь;
	
	Если ТекущиеДанные.ЕстьСпецификация Тогда
		
		ПараметрыДерева = ПараметрыДереваСпецификаций();
		Если ПараметрыДерева.Спецификация <> ТекущиеДанные.Спецификация Тогда
			ПараметрыДерева.Спецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка();
		КонецЕсли;
		УправлениеДаннымиОбИзделиях.ИзменитьСпецификациюВСтрокеДерева(ЭтаФорма, ПараметрыДерева, ТекущиеДанные);
		
	ИначеЕсли ДинамическоеСчитывание Тогда
		
		УправлениеДаннымиОбИзделиях.ОбновитьРеквизитыСтрокиДереваВХранилище(ЭтаФорма, ТекущиеДанные);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСпецификациюВТекущейСтроке(ТекущаяСтрока, НоваяСпецификация = Неопределено)
	
	ТекущиеДанные = ДеревоСпецификаций.НайтиПоИдентификатору(ТекущаяСтрока);
	
	ТекущиеДанные.Спецификация = НоваяСпецификация;
	
	ОбработатьИзменениеРеквизитаСтрокиДереваНаСервере(ТекущаяСтрока);
	
	РазвернутьДеревоСпецификаций(ТекущаяСтрока, ТекущиеДанные.Идентификатор);

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоСпецификаций(ТекущаяСтрока, Идентификатор)
	
	Если Элементы.ДеревоСпецификаций.ТекущаяСтрока <> ТекущаяСтрока Тогда
		
		ТекущиеДанные = НайтиСтрокуПоИдентификатору(ДеревоСпецификаций.ПолучитьЭлементы(), Идентификатор);
		Если ТекущиеДанные <> Неопределено Тогда
			Элементы.ДеревоСпецификаций.ТекущаяСтрока = ТекущиеДанные.ПолучитьИдентификатор();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(СПодчиненными = Истина)

	СтрокиДерева = ДеревоСпецификаций.ПолучитьЭлементы();
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		Элементы.ДеревоСпецификаций.Развернуть(СтрокаДерева.ПолучитьИдентификатор(), СПодчиненными);
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе()

	СтрокиДерева = ДеревоСпецификаций.ПолучитьЭлементы();
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		Элементы.ДеревоСпецификаций.Свернуть(СтрокаДерева.ПолучитьИдентификатор());
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ИзмененыПараметрыОтбора()
	
	ИзмененыПараметрыОтбора = Истина;
	Элементы.ПечатьДереваСпецификаций.Доступность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьПараметрыОтбора()
	
	ПараметрыОтбора = Новый Структура("
		|ДеревоВыводитьЭтапы,
		|ДеревоВыводитьВыходныеИзделия,
		|ДеревоВыводитьМатериалы,
		|ДеревоВыводитьТрудозатраты,
		|ДеревоВыводитьЗаголовкиГруппировок");
	ЗаполнитьЗначенияСвойств(ПараметрыОтбора, ЭтаФорма);
	
	ХранилищеНастроекДанныхФорм.Сохранить("ДеревоРесурсныхСпецификаций", "ПараметрыОтбора", ПараметрыОтбора);
	
	Элементы.ПечатьДереваСпецификаций.Доступность = Истина;
	ИзмененыПараметрыОтбора = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьГруппыПараметровНазначенияСпецификаций(ТолькоПросмотр = Ложь)
	
	ВидимостьГруппы = Ложь;
	
	Для каждого ИмяПараметра Из СтрРазделить("НаправлениеДеятельности,ПодразделениеДиспетчер", ",") Цикл
		Если УправлениеДаннымиОбИзделияхПовтИсп.ПараметрНазначенияИспользуется(
					Перечисления.ВидыПараметровНазначенияСпецификаций[ИмяПараметра]) Тогда
			Элементы[ИмяПараметра].Видимость      = Истина;
			Элементы[ИмяПараметра].ТолькоПросмотр = ТолькоПросмотр;
			ВидимостьГруппы = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ГруппаПараметрыНазначенияСпецификаций.Видимость = ВидимостьГруппы;
	Если ВидимостьГруппы Тогда
		ОбновитьЗаголовокГруппыПараметровНазначенияСпецификаций(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЗначенияПараметраНазначенияСпецификаций()
	
	ОбновитьЗаголовокГруппыПараметровНазначенияСпецификаций(ЭтаФорма);
	ОбновитьДанные();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЗаголовокГруппыПараметровНазначенияСпецификаций(Форма)
	
	КоличествоЗаполнено = 0;
	
	Если ЗначениеЗаполнено(Форма.ПараметрНазначенияПодразделениеДиспетчер) Тогда
		КоличествоЗаполнено = КоличествоЗаполнено + 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Форма.ПараметрНазначенияНаправлениеДеятельности) Тогда
		КоличествоЗаполнено = КоличествоЗаполнено + 1;
	КонецЕсли;
	
	Форма.ПараметрНазначенияКоличествоЗаполненных = КоличествоЗаполнено;
	
КонецПроцедуры

#КонецОбласти
